/*
    12개 질문에 대한 데이터를 보관하는 배열!

    4가지 유형에 대한 질문3개씩
    외향형, 감각형, 사고형, 판단형일때 1번
    내향형, 직관형, 감정형, 인식형일때 2번
*/
export const questionContent = [
    {
        number: 1,
        question: "오늘은 수업이 없는 주말이다. 주말에 그린고트를 가려는데 혼자갈까? 아니면 친구들이랑 갈까?",
        answer1: "론, 헤르미온느랑 같이가야 재밌지~",
        answer2: "혼자가는게 편해!",
        type: "e"
    },
    {
        number: 2,
        question: "수업이 끝나고 기숙사를 가는데, 괴롭힘을 당하는 학생을 보았다. 당신의 행동은?",
        answer1: "도와주기 위해 마법을 사용한다!",
        answer2: "몰래 맥고나걸 교수님에게 이른다~",
        type: "e"
    },
    {
        number: 3,
        question: "오늘 론과 말다툼을 하였다! 이 분위기를 반전시키고 싶은데 어떻게 하면좋을까?",
        answer1: "직접 먼저 가서 화해를 한다~",
        answer2: "쪽지를 남기거나, 론이 먼저 말걸때까지 기다린다!",
        type: "e"
    },
    {
        number: 4,
        question: "오늘은 헤르미온느의 생일이다! 선물로 뭘해주면 좋을까?",
        answer1: "이 옷을 입으면 헤르미온느가 예뻐보일거야",
        answer2: "요즘 우울해 보이던데 비타민C를 사주자!",
        type: "s"
    },
    {
        number: 5,
        question: "스네이프가 덤블도어를 죽이는 것을 보았다. 나의 생각은?",
        answer1: "스네이프 저 개XX!!, 바로 스네이프에게 죽음의 저주를 건다!",
        answer2: "교수님이 생각이 있어서 그랬을꺼야..., 더 생각해보기로 한다!",
        type: "s"
    },
    {
        number: 6,
        question: "지니와 런던에서 데이트를 하는 도중 급히 밥을 먹으러 가기로 한다! 어디로 밥먹으러 가지?",
        answer1: "위즐리 어머니가 요리하는 곳이니 딱봐도 맛집이야! 여기가자~",
        answer2: "헤르미온느에게 물어봐서 지니가 좋아하는 곳으로 데려간다!",
        type: "s"
    },
    {
        number: 7,
        question: "론이 헤르미온느와 싸우고 나에게 하소연을 한다. 나의 반응은?",
        answer1: "내가 보기엔 조급함이 문제야. 그런데 너도 문제가 있어!",
        answer2: "와 진짜? 헤르미온느 진짜 별로다!",
        type: "t"
    },
    {
        number: 8,
        question: "시리우스가 생일날 빗자루를 보냈다. 내 느낌은?",
        answer1: "아즈카반 감옥살이 힘드실텐데,, 뭐 이런걸 다..꾸벅",
        answer2: "헐!! 완전 너무 좋아~ 감사합니다 ㅠㅠ",
        type: "t"
    },
    {
        number: 9,
        question: "신비한 동물 수업시간에 말포이가 깝죽대다가 벅빅에서 떨어졌다. 다리가 부러진거같은데,,",
        answer1: "치료마법으로 치료해주면 되지 뭐!",
        answer2: "많이 아프겠다...",
        type: "t"
    },
    {
        number: 10,
        question: "오늘은 호그와트 파티가 있는 날이다. 옷을 뭐입을까??",
        answer1: "전날부터 고민해서 머리부터 발끝까지 세팅완료!",
        answer2: "나가기 직전 까지 무슨 옷이 좋을지 고민하다 이 옷을 입는다!",
        type: "j"
    },
    {
        number: 11,
        question: "몸이 많이 아파 데이트를 취소했다. 그런데 상대방이 병문안 겸 집에 찾아온다고 했을때, 나의 반응은?",
        answer1: "몸이 아픈데도 불구하고 대청소 시작..",
        answer2: "일단 보이는 곳만 치우자! 현관, 거실, 내 방!!",
        type: "j"
    },
    {
        number: 12,
        question: "죽음의 성물을 찾으러 가는 계획을 짜고있다. 어떻게 할까?",
        answer1: "계획은 철저한게 중요해! 일별로 세부일정을 다 짜놓는다!",
        answer2: "어차피 계획짜봤자, 그대로 안돼!! 큰 일정만 짜놓자!",
        type: "j"
    }
]